<template>
  <div class="messageWarp">
    <van-nav-bar
      title="关于我们"
      left-arrow
      @click-left="onClickRight"
    />
    <div class="detail">
      <div class="messageItem">
        <p class="des">吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的吃地区教委的</p>
      </div>
    </div>
  </div>
</template>
<script type="text/ecmascript-6">
  export default {
    methods:{
      onClickRight(){
        this.$router.back(-1)

      }
    }
  }
</script>
<style lang="scss" scoped>
  .messageItem{
    overflow: hidden;
    background: #fff;
    margin-top:.2rem;
    padding: .2rem;
    &.opacitymin2{
      .title{
        color: rgba(0,0,0,0.3);
      }
      .time{
        color: rgba(0,0,0,0.1);
      }
      .des{
        color: rgba(0,0,0,0.2);
      }
    }
    .title{
      font-size:17px;
      color: rgba(0,0,0,0.8);
    }
    .time{
      font-size:13px;
      color: rgba(0,0,0,0.4);
      margin:.15rem 0 .2rem;
    }
    .des{
      font-size:15px;
      color: rgba(0,0,0,0.6);
    }
  }
</style>
